app/controllers/agents_controller.rb

  def index
    @nodes = Node.where(type: ["Person", "Organization"])
---
SELECT "nodes".* FROM "nodes" WHERE "nodes"."type" IN ($1, $2)  [["type", "person"], ["type", "organization"]]