app/controllers/edges_controller.rb

SELECT "edges".* FROM "edges"
---
  def index
    @edges = Edge.all

INSERT INTO "edges" ("predicate", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["predicate", "has_friend"], ["created_at", "2018-02-24 21:27:41.935311"], ["updated_at", "2018-02-24 21:27:41.935311"]]
---
  def create

    @edge = Edge.new(edge_params)

    if @edge.save

UPDATE "edges" SET "predicate" = $1, "updated_at" = $2 WHERE "edges"."id" = $3  [["predicate", "has_enemy"], ["updated_at", "2018-02-24 21:48:08.079979"], ["id", 1]]
---
  def update
    if @edge.update(edge_params)

DELETE FROM "edges" WHERE "edges"."id" = $1  [["id", 1]]
---
  def destroy
    @edge.destroy

SELECT  "edges".* FROM "edges" WHERE "edges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_edge
      @edge = Edge.find(params[:id])