app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" ORDER BY "events"."id" ASC

  def create
    @event = Event.new(attributes: event_params)

    if @event.save
---
INSERT INTO "events" ("name", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "An Exhibition"], ["body", "This is body text for this exhibition."], ["user_id", 201799169], ["created_at", "2018-01-15 03:44:55.245221"], ["updated_at", "2018-01-15 03:44:55.245221"]]

  def update
    if @event.update(attributes: event_params)
---
UPDATE "events" SET "name" = $1, "body" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["name", "Different Name"], ["body", "A different body text."], ["updated_at", "2018-01-14 18:45:04.966396"], ["id", 980190962]]

  def destroy
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 980190962]]

    def set_event
      @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 ORDER BY "events"."id" ASC LIMIT $2  [["id", 980190962], ["LIMIT", 1]]