app/controllers/nodes_controller.rb

SELECT "nodes".* FROM "nodes"
---
  def index
    @nodes = Node.all

INSERT INTO "nodes" ("type", "slug", "title", "properties", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["type", "Event"], ["slug", "new-event"], ["title", "New Event"], ["properties", "{}"], ["body", "test"], ["created_at", "2018-03-14 02:25:18.745665"], ["updated_at", "2018-03-14 02:25:18.745665"]]
---
  def create
    @node = Node.new(node_params)

    if @node.save

UPDATE "nodes" SET "properties" = $1, "updated_at" = $2 WHERE "nodes"."id" = $3  [["properties", "{\"websites\":[{\"url\":\"http://example.com\"},{\"url\":\"flaggleblarf\"}]}"], ["updated_at", "2018-03-22 03:42:57.413228"], ["id", 13]]
---
  def update
    if @node.update(node_params)

DELETE FROM "nodes" WHERE "nodes"."type" IN ('Event') AND "nodes"."id" = $1  [["id", 13]]
---
  def destroy
    @node.destroy

SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_node
      @node = Node.find(params[:id])