app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."id" ASC
---
  def index
    @organizations = Organization.all