app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY "pages"."id" ASC
---
  def index
    @pages = Page.all

INSERT INTO "pages" ("name", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Page 1"], ["body", "This is some body text."], ["user_id", 257861776], ["created_at", "2018-01-15 03:58:57.206880"], ["updated_at", "2018-01-15 03:58:57.206880"]]
---
  def create
    @page = Page.new(page_params)

    if @page.save

UPDATE "pages" SET "name" = $1, "body" = $2, "updated_at" = $3 WHERE "pages"."id" = $4  [["name", "Different Name"], ["body", "A different body text."], ["updated_at", "2018-01-14 18:56:01.084723"], ["id", 980190962]]
---
  def update
    if @page.update(page_params)

DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 980190962]]
---
  def destroy
    @page.destroy

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 ORDER BY "pages"."id" ASC LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_page
      @page = Page.find(params[:id])