app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Billy"], ["email", "billy@flurg.com"], ["created_at", "2018-04-02 11:30:02.841030"], ["updated_at", "2018-04-02 11:30:02.841030"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Different Name"], ["email", "anotheremail@example.com"], ["updated_at", "2018-01-14 19:01:47.765557"], ["id", 980190962]]